//----------------------------------------------------------------------------------------------------
//подключаемые библиотеки
//----------------------------------------------------------------------------------------------------
#include "based.h"
#include "wh1602.h"
//----------------------------------------------------------------------------------------------------
//глобальные переменные
//----------------------------------------------------------------------------------------------------

char String[25];//строка

#if defined LANGUAGE_RU
static const char Text_Press_Any_Key[] PROGMEM =          "Нажм. любую кнп \0";
#else
static const char Text_Press_Any_Key[] PROGMEM =          "Press any key...\0";
#endif
//----------------------------------------------------------------------------------------------------
//ќжидание нажати€ любой кнопки
//----------------------------------------------------------------------------------------------------
void PressAnyKey(void){
	WH1602_SetTextProgmemDownLine(Text_Press_Any_Key);
	while(!((BUTTON_UP_PIN&(1<<BUTTON_UP))||(BUTTON_DOWN_PIN&(1<<BUTTON_DOWN))||(BUTTON_CENTER_PIN&(1<<BUTTON_CENTER))||(BUTTON_SELECT_PIN&(1<<BUTTON_SELECT)))){;}
}